Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: These identifiers are used in this document to identify the curve used in the SSH ECC public key format, the ECDSA signature blob, and the ECDH method name.
ja: これらの識別子は, この文書で以下を識別するために用いられている: SSH 楕円曲線公開鍵フォーマットや, ECDSA署名blob, ECDHの方法名だ.

source: Processing of this message stops.
ja: このメッセージの処理は停止する.

source: The block size is 16 bytes.
ja: ブロックサイズは 16 byte だ.

source: Message numbers (see Section 7) in the range of 0 to 191 are allocated via IETF CONSENSUS, as described in [RFC2434].
ja: (セクション 7を参照) メッセージ番号 1 から 191 までの範囲は, IETFの合意により割当てられ. [RFC2434]に記述されている.

source: Implementers should use the SSH_MSG_IGNORE packet, along with the inclusion of random lengths of padding, to thwart attempts at traffic analysis.
ja: 実装者は, トラフィック解析の試みを妨げるため, ランダムな長さのパディングと共にSSH_MSG_IGNOREパケットを使わなければならない.

source: How the SSH user name is extracted from the SSH layer is implementation-dependent.
ja: SSHのユーザ名をSSH層からどう抽出するかは実装依存だ.

source: read from user encrypt null packet encrypt data packet
ja: ユーザから読み込み null パケットを暗号化 data パケットを暗号化

source: This document provides new public key algorithms for the Secure Shell protocol that convey public keys using X.509v3 certificates.
ja: この文書は, X.509v3 証明書を用いて証明書を伝達するセキュアシェルプロトコルのための新しい公開鍵アルゴリズムを提供する.

source: Environment Variable Passing
ja: 環境変数の転送

source: Security Considerations .........................................4 5.
ja: セキュリティの考察 .........................................4 5.

source: This document creates no new registries.
ja: この文書は新しいレジストリは作成しない.

source: Encryption of the packet length does little in and of itself to disguise the length of the underlying binary packets.
ja: packet length の暗号化は, 基底のバイナリパケットの長さをごまかすのにほとんど効果がない.

source: This value MUST be constant for the entire SSH session, and future messages received MUST result in the tmSecurityName being set to the same value.
ja: この値は, 全体の SSH のセッションで定数でなければならない. 将来受信するメッセージは, tmSecurityNameが同じ値に設定されていなければならない.

source: For outgoing messages, the Transport Model takes input provided by the Dispatcher in the sendMessage() ASI.
ja: 送信メッセージに対して, トランスポートモデルは, sendMessage() ASI で Dispatcher が提供する入力を取得する.

source: If this is a server-side SSH session and this is the first message received over the session, then the tmTransportAddress is set to the address the message originated from, determined in an implementation-dependent way.
ja: サーバ側のSSHのセッションの場合でこれがセッションを介して受信した最初のメッセージならば, tmTransportAddress は, 実装依存の方法で決定されたメッセージの送り元のアドレスに設定される.

source: Specific to this document, it is RECOMMENDED that implementations disable all the potentially dangerous features (e.g., agent forwarding, X11 forwarding, and TCP/IP forwarding) if the host key has changed without notice or explanation.
ja: この文書に特有のこととして, ホスト鍵が注意や説明なしに変更された場合には, すべての潜在的に危険な特徴(たとえば, エージェントの転送, X11の転送, TCP/IPの転送)を実装が無効にすることを推奨する.

source: Completion of User Authentication
ja: ユーザ認証の完了

source: The SSH Transport Model has no way to verify that server authentication was performed, to learn the host's public key in advance, or to verify that the correct key is being used.
ja: SSH トランスポートモデルは, サーバ認証が行なわれたかを検証したり, 事前にホスト公開鍵を取得したり, 正しい鍵が利用されているかを検証する方法を持っていない.

source: The 'message' doesn't need to contain a newline.
ja: 'message' は改行を含む必要はない.

source: To minimize delays in screen updates, one does not want excessively large packets for interactive sessions.
ja: 画面の更新の遅れを最小にするため, インタラクティブなセッションで過剰な大きなパケットは求められない.

source: Attribute names are defined following the same scheme laid out for algorithm names in [1].
ja: [1] のアルゴリズム名のために示されたのと同じ方式に従ってアルゴリズム名は定義される.

source: This method MUST be supported for interoperability as all of the known implementations currently support it.
ja: この方法は, 現在知られている実装はすべてサポートしているので, 相互運用性のためにサポートされなければならない.

source: The SSH protocol is not always clear on whether the user name field must be filled in, so for some implementations, such as those using GSSAPI authentication, it may be necessary to use a mapping algorithm to transform an SSH identity to a tmSecurityName or to transform a tmSecurityName to an SSH identity.
ja: SSH プロトコルでは, ユーザ名のフィールドが埋められているかどうか常には明確ではない. GSSAPI 認証を用いる実装などのそのような実装のため, SSHの情報と tmSecurityName を変換する, もしくは tmSecurityName を SSHの識別情報に変換するマップアルゴリズムが必要なことがある.

source: After the optional user name field and '@' character comes the hostname or IP address.
ja: オプションのユーザ名フィールド と '@' 文字の後で, ホスト名かIPアドレスが続く.

source: Also, a lot of trust is placed on the central infrastructure.
ja: 加えて, 中央のインフラ上に多数の信用情報が置かれる.

source: tmSessionID = an implementation-dependent value that can be used to detect when a session has closed and been replaced by another session.
ja: tmSessionID = セッションが閉じたり別のセッションで置き換えられた場合を検出するの用いられる実装依存の値

source: If a guessed packet will be sent, this MUST be TRUE.
ja: 推測したパケットが送られる場合, これは TRUE でなければならない.

source: SSH provides for algorithms that provide authentication, key agreement, confidentiality, and data-integrity services.
ja: SSH は, 認証, 鍵の合意, 機密性, データ完全性サービスを提供するアルゴリズムを提供する.

source: The SSH_MSG_CHANNEL_OPEN_FAILURE 'reason code' values are defined in the following table.
ja: SSH_MSG_CHANNEL_OPEN_FAILURE の 'reason code' の値は, 次の表で定義される.

source: Instead, it is RECOMMENDED to deploy SNMPv3 and to enable cryptographic security.
ja: かわりに SNMPv3 を配置し 暗号のセキュリティを有効にするのを推奨する.

source: Care should be taken so that this doesn't become a self- denial of service vector.
ja: これが, 自己のサービス妨害を起こさないようにに注意する必要がある

source: * For these three REQUIRED curves, the elliptic curve domain parameter identifier is the string in the first column of the table, the NIST name of the curve.
ja: * これらの3つの必須の曲線では, 楕円曲線ドメインパラメータ識別子は, この表の最初のカラムの文字列, 曲線のNIST名だ.

source: For concreteness, we specify this explicitly below.
ja: 以下で具体的に指定する.

source: o in the SSH_MSG_USERAUTH_REQUEST message when "publickey" authentication is used [RFC4252]
ja: o "publicky" 認証が用いられる SSH_MSG_USERAUTH_REQUEST メッセージ内 [RFC4252]

source: Such a condition can be indicated by the following message.
ja: そのような状態は, 次のメッセージによって示される.

source: The "diffie-hellman-group14-sha1" method specifies a Diffie-Hellman key exchange with SHA-1 as HASH and Oakley Group 14 [RFC3526] (2048- bit MODP Group), and it MUST also be supported.
ja: "diffie-hellman-group14-sha1" 法は, HASH として SHA-1 またOakley Group 14 [RFC3526] (2048-bit MODP Group)を用いる Diffie-Hellman 鍵交換を指定する. そしてこの方法もサポートされなければならない.

source: Group Exchange
ja: 群の交換

source: The Session Channel Break Extension provides a means to send a BREAK signal over a Secure Shell (SSH) terminal session.
ja: セッションチャンネルBreak拡張は, セキュアシェル(SSH)のターミナルセッションで BREAK シグナルを送る手段を提供する.

source: IANA has assigned:
ja: IANA は以下を割り当てた:

source: All other allocations are to be made by IETF consensus, as defined in [RFC2434].
ja: [RFC2434] で定義されているように, IETF での合意によってその他のすべての割り当てが行なわれるべきだ.

source: The mandatory algorithms are specified in the relevant protocol documents.
ja: 実装を義務付けられているアリゴリズムはそれぞれのプロトコルの文書で指定される.

source: If this message is received by the server when the negotiated GSS-API context supports per-message integrity protection, the server MUST fail the authentication.
ja: 交渉済みの GSS-API コンテキストが メッセージ単位の完全性保護をサポートしている場合にこのメッセージをサーバが受け取ったら, サーバは認証を失敗させなければならない.

source: Weak distinguishers can operate on any part of the keystream, and the best ones, described in [FMcG] and [MANTIN05], can use data from multiple, different keystreams.
ja: 弱い識別者による攻撃は鍵ストリームの任意の部分を操作する. [FMcG]や[MANTIN05]で記述された最良の攻撃では, 複数の異なる鍵ストリームからデータを識別できる.

source: It is used by authentication methods as a part of the data that is signed as a proof of possession of a private key.
ja: これは, 認証法の中で, 秘密鍵の所有を証明するために署名されるデータの一部として使われる.

source: Introduction ....................................................3 1.1.
ja: イントロダクション ....................................................3 1.1.

source: Requests for assignments of new names MUST be done through the IETF CONSENSUS method, as described in [RFC2434].
ja: 新しい名前の割り当ての要求は, [RFC2434] に記述されている IETF CONSENSUS によってされなければならない.

source: Service Names .............................................13 4.8.
ja: サービス名............................................13 4.8.

source: The hostname is always in US-ASCII (as per RFC1033); internationalized hostnames are encoded in US-ASCII as specified in RFC 3490.
ja: ホスト名は常に US-ASCII (RFC1033 のように) だ; 国際化されたホスト名は RFC 3490 で指定されているように US-ASCII でエンコードされる.

source: where unencrypted_packet is the entire packet without 'mac' (the length fields, 'payload' and 'random padding'), and sequence_number is an implicit packet sequence number represented as uint32.
ja: unencrypted_packet は, 'mac' を除くパケット全体(the length fields, 'payload', 'random padding')だ. sequence_number は, uint32 で表現される明示されないパケットのシーケンス番号だ.

source: These messages do not consume window space and can be sent even if no window space is available.
ja: これらメッセージは, window space を消費しない. window space が残っていない場合にも送ることができる.

source: More explicitly, after a key exchange, an SSH implementation SHOULD NOT send more than 2**32 packets before rekeying again.
ja: より明確に言うと, 鍵の交換の後で再び再生成をする前に 2**32個以上のパケットをSSHの実装は送らないほうがよい.

source: The hash H is computed as the HASH hash of the concatenation of the following:
ja: ハッシュ H は, 次の連結に対する HASH の結果だ:

source: Figure 3: Structure of an SSH AES-GCM Nonce
ja: 図3: SSH AES-GCM のナンスの構造

source: A request is acknowledged by sending a status packet.
ja: 要求は 状態パケットを送ることで確認応答される.

source: Stored as four bytes in the order of decreasing significance (network byte order).
ja: 位が降順の4byteの値として格納される(ネットワークバイトオーダー)

source: o The SSH public key algorithm "x509v3-rsa2048-sha256".
ja: o SSH 公開鍵アルゴリズム "x509v3-ssh-rsa2048-sha256".

source: (The identity may undergo various transforms before it maps to the securityName.)
ja: (識別情報は, securityName へのマップの前に様々な変換を受ける可能性がある.)

source: The client MAY accept the host key without verification, but doing so will render the protocol insecure against active attacks.
ja: クライアントは, 検証なしにホスト鍵を受けいれてもよい. しかし, これはプロトコルヲを能動的な攻撃に対して安全でなくしてしまう.

source: Service Request
ja: サービスの要求

source: Additionally, the underlying MAC may begin to leak information about the protocol's payload data.
ja: さらに, 基底のMACがプロトコルのペイロードのデータについての情報を漏らしはじめる.

source: 9.4.4 Public Key Authentication
ja: 9.4.4 公開鍵認証

source: Disconnection Messages Reason Codes and Descriptions .......7 4.2.1.
ja: 切断メッセージの reason code (理由コード)と description(説明)...7 4.2.1.

source: Thus, implementers may wish to use other methods, but should take care to ensure they are secure.
ja: それゆえ, 実装者は, 別の方法を使いたいと考えるかもしれない. このときその方法が安全なことを保証するよう注意しなければならない.

source: While some security- conscious users verify the fingerprint out-of-band before accepting the key, many users blindly accept the presented key.
ja: セキュリティ意識の高いユーザは鍵を受け入れる前に SSHの通信の外側で指紋を検査する. しかし, 多くのユーザは提示されたキーを受け入れる.

source: In this case, several mechanisms are available for communicating error information to the peer before terminating the connection as required by [SSH-TRANSPORT]:
ja: この時, [SSH-TRANSPORT] によって 接続を終了する前に必要に応じて相手にエラー情報を伝えるいくつかのメカニズムが提供されている.

source: Control of Function through Configuration and Policy ......13 8.2.
ja: 設定とポリシーによる機能の管理 ......13 8.2.

source: While this form of authentication is not suitable for high-security sites, it can be very convenient in many environments.
ja: この認証法は, 高いセキュリティを求めるサイトには適していないが, 多くの環境で非常に便利だろう.

source: Disconnection Messages Reason Codes and Descriptions
ja: 切断メッセージの reason code (理由コード)と description(説明)

source: The elliptic curve ephemeral public keys (points) that must be transmitted are encoded into octet strings before they are transmitted.
ja: 転送される楕円曲線一時的公開鍵(点)は, 転送前に8bit文字列にエンコードする必要がある.

source: The value zero MUST be stored as a string with zero bytes of data.
ja: 値 0 は, 0 バイトのデータの stringとして格納されなければならない.

source: Private keys are often stored in an encrypted form at the client host, and the user must supply a passphrase before the signature can be generated.
ja: 秘密鍵は, しばしばクライアントのホストに暗号化されて保持される. ユーザは, 署名が生成される前にパスフレーズを提供しなければならない.

source: SSH_MSG_KEXECDH_INIT C->S Contains the client's ephemeral elliptic curve Diffie-Hellman key.
ja: SSH_MSG_KEXECDH_INIT C->S クライアントの一時楕円曲線 Diffie-Hellman 鍵を含む.

source: Both sides are responsible for verifying that the remote entity presents the right key.
ja: どちらの側も, リモートのエンティティが正しい鍵を提示するか検証する責任がある.

source: No explicit response is sent to this message.
ja: このメッセージに明示的な返答は送られない.

source: o The selection of Family 1 versus Family 2 is independent of the choice of server host key algorithm.
ja: o Family 1 か Family 2 の選択は, サーバのホスト鍵アルゴリズムの選択とは独立だ.

source: o The host name-to-key association is certified by a trusted certification authority (CA).
ja: o ホストの名前と鍵との関連を, 信頼された認証局(CA)が保証する.

source: Additionally, the following constraints apply:
ja: さらに, 以下の制限が適用される:

source: The format of this string is specified in Section 6.1.
ja: この文字列のフォーマットは, 6.1節で指定する.

source: GSS-API authentication must maintain a context.
ja: GSS-API 認証はコンテキストを維持しなければならない．

source: It is RECOMMENDED that the keys be changed after each gigabyte of transmitted data or after each hour of connection time, whichever comes sooner.
ja: 転送データが1ギガバイトになるたびもしくは接続時間1時間経過のたび, どちらか早い方の後で, 鍵を変更することが推奨される.

source: o Initial IV client to server: HASH(K || H || "A" || session_id) (Here K is encoded as mpint and "A" as byte and session_id as raw data.
ja: o クライアンントからサーバへの初期 IV : HASH(K || H || "A" || session_id (ここで, K は mpint に, "A" は バイトに, session_id は 生データとしてエンコードされる.

source: For recommendations on this, see [RFC3766].
ja: これについての推奨は, [RFC3766] を参照.

source: If a "user@" prefix is used within an SnmpSSHAddress value to specify an SSH user name to use for authentication, then the key presented to the remote entity MUST be the key expected by the server for the "user".
ja: "user@" プレフィックスが, 認証で用いる SSH ユーザ名を指定するため SnmpSSHAddress の値に含まれている場合, リモートのエンティティへ提示される鍵は, "user" に対してサーバが期待する鍵でなければならない.

source: Status Codes .
ja: 状態コード .

source: The 'none' MAC Algorithm
ja: 'none' MAC アルゴリズム

source: This key exchange algorithm is implemented with the following messages.
ja: この鍵交換アルゴリズムは, 次のメッセージ群で実装される.

source: Algorithm Negotiation: SSH_MSG_KEXINIT
ja: アルゴリズムの交渉: SSH_MSG_KEXINIT

source: If the server does not support administrative settings of this nature, it MUST return false in the compulsory field.
ja: サーバがこの管理の設定をサポートしていないなら, compulsory フィールドは false を返さなければならない.

source: The keys are generated as shown in Figure 1.
ja: 鍵は, 図1のように生成される.

source: Without this technique, a specific attack may be successful.
ja: このテクニックがなしでは, 特定の攻撃は成功するだろう.

source: The initial assignments for the 'data_type_code' values and 'data' values are given in the table below.
ja: 'data_type_code' と ''data' の初期の割り当ては, 以下に示す表で与えられる.

source: Initially, the MAC algorithm MUST be "none".
ja: 最初は, MACのアルゴリズムは "none" でなければならない.

source: An X.509v3 certificate containing the server's public signing ECDSA key and an ECDSA signature on the exchange hash value derived from the newly established shared secret value are used to authenticate the server to the client.
ja: サーバ公開署名 ECDSA 鍵を含む X.509v3 証明書と, 新しく確立した共有秘密値から導出される交換ハッシュに対する ECDSA 署名が, クライアントに対してサーバを認証するのに用いられる.

source: Key Exchange Methods
ja: 鍵交換法

source: Upon receiving this message, a party MUST send back an SSH_MSG_CHANNEL_CLOSE unless it has already sent this message for the channel.
ja: まだこのメッセージを送信していないのにこのメッセージを受信した側は, SSH_MSG_CHANNEL_CLOSE を送り返さなければならない.

source: Since public keys tend to be very large, it is difficult for a human to verify an entire host key.
ja: 公開鍵は非常に大きいので, ホスト鍵全体を人間が検証するのは困難だ.

source: It is expected that in most environments, only 2 round-trips will be needed for full key exchange, server authentication, service request, and acceptance notification of service request.
ja: 多くの環境で, 完全な鍵交換, サーバ認証, サービスの要求, サービスの要求の承認の通知のために2回の往復しか必要がない.

source: Encryption keys MUST be computed as HASH, of a known value and K, as follows:
ja: 暗号鍵は, 既知の値とKに対する HASH によって次のように計算されなければならない.

source: Public Key Algorithm Names
ja: 公開鍵アルゴリズム名

source: In the following sections, the values for the name spaces are textual.
ja: 以下の節では, 名前空間の値はテキストだ.

source: Public Key Algorithms .....................................13 7.
ja: 公開鍵アルゴリズム..................................13 7.

source: Public keys conveyed using the x509v3-ecdsa-sha2-* public key algorithms can be used with the ecmqv-sha2 key exchange method.
ja: x509v3-ecdsa-sha2-* 公開鍵アルゴリズムで伝達される公開鍵は, ecmqv-sha2 鍵交換メソッドで利用できる.

source: After the client's first call to GSS_Init_sec_context(), it sends the following:
ja: クライナントは, 最初の GSS_Init_sec_context() の呼び出しの後で以下を送る:

source: Alternatively, support for the BREAK facility MAY be implemented as configurable on a per-port or per-server basis.
ja: また, BREAK 機能のサポートは, ポート単位やサービス単位のベースで設定可能に実装されてもよい.

source: 9 VSTOP Pauses output (normally control-S).
ja: 9 VSTOP 出力を中断する. (通常は control-S).

source: If a client's policy is to first prefer GSS-API-based key exchange method X, then non-GSS-API method Y, then GSS-API-based method Z, and if a server supports mechanisms Y and Z but not X, then an attempt to use SPNEGO to negotiate a GSS-API mechanism might result in the use of method Z when method Y would have been preferable.
ja: 最初に GSS-API ベースの鍵交換法 X を好み次に GSS-API でない方法 Y を好み, そして GSS-APIベースの方法を好むクライアントのポリシーでサーバが Y と Z をサポートするが X をサポートしない場合, Y が好ましい方法だが, GSS-API メカニズムの交渉のためにSPENGOを利用すると Z の利用という結果になる.

source: The use of the Simple and Protected GSS-API Negotiation Mechanism [SPNEGO] in conjunction with the authentication and key exchange methods described in this document is both unnecessary and undesirable.
ja: Simple and Protected GSS-API Negotiation Mechanism [SPNEGO] をこの文書に記述した認証法と鍵交換法と一緒に利用する必要はなく, 望ましくない.

source: The Extended Channel Data Transfer 'data_type_code' is a uint32 value.
ja: 拡張チャンネルデータ転送の 'data_type_code' は uint32の値だ.

source: Increment the snmpSshtmSessionCloses counter.
ja: snmpSshtmSessionCloses カウンタをインクリメントする.

source: The "aes192-ctr" method uses AES with 192-bit keys.
ja: "aes192-ctr" は 192-bit の鍵を用いる AES を使う.

source: The maximum of 35000 bytes is an arbitrarily chosen value that is larger than the uncompressed length noted above.
ja: 最大値の 35000 byte は, 上で述べた非圧縮の長さよりも大きい任意に選ばれた値だ.

source: The "pgp-sign-dss" is as above, but indicates that the key is a DSS-key.
ja: "pgp-sign-dss" も同様だが, 鍵が DSS鍵であることを示している.

source: Pass the wholeMessage to SSH for encapsulation as data in an SSH message over the identified SSH session.
ja: 識別された SSH セッションの SSH メッセージのデータとしてカプセル化のため, メッセージ全体をSSHに渡す.

source: This memo describes the Secure Shell Transport Model for SNMP, a specific SNMP Transport Model to be used within the SNMP Transport Subsystem to provide authentication, encryption, and integrity checking of SNMP messages.
ja: このメモは, SNMP のためのセキュアシェルトランスポートモデル, すなわち, SNMPメッセージの認証や暗号化,完全性検査を提供する SNMP トランスポートサブシステムの中で利用されるSNMPトランスポートモデルについて記述している.

source: The core protocol uses Diffie-Hellman key exchange.
ja: コアプロトコルでは, Diffie-Hellman 鍵交換を利用している.

source: The protocol allows full negotiation of encryption, integrity, key exchange, compression, and public key algorithms and formats.
ja: プロトコルは, 暗号化や完全性, 鍵交換, 圧縮, 公開鍵のアルゴリズムのフォーマットについて, 完全にネゴシエーションすることができる.

source: Implementations SHOULD support this request.
ja: 実装は, この要求をサポートする必要がある.

source: Note, however, that during a key re-exchange, after sending a SSH_MSG_KEXINIT message, each party MUST be prepared to process an arbitrary number of messages that may be in-flight before receiving a SSH_MSG_KEXINIT message from the other party.
ja: しかし, SSH_MSG_KEXINIT が送られた後の鍵交換の間に, 相手側から SSH_MSG_KEXINIT メッセージを受け取るまでは 送信中かもしれない任意の番号のメッセージを処理する準備がされていなければならないことに注意.

source: An encryption algorithm and a key will be negotiated during the key exchange.
ja: 暗号アルゴリズムと鍵は, 鍵交換の間に取り決められる.

source: This must be balanced, though, against the known security problems with Arcfour described in Section 5.
ja: しかし, 5節で記述する Arcfour の既知のセキュリティの問題によって釣り合いがとれている.

source: Individual mechanisms specified in the authentication protocol use the session id provided by the transport protocol and/or depend on the security and integrity guarantees of the transport protocol.
ja: 認証プロトコルで定義されるそれぞれのプロトコルは, トランスポートプロトコルで提供されるセッションidを利用したり, トランスポート層のセキュリティと完全性の保証に依存することがある. 両方を必要とする場合もある.

source: Such messages MUST be otherwise ignored.
ja: さもなければ, これらのメッセージは無視されなければならない.

source: The encryption is performed according to the RSAES-OAEP scheme of [RFC3447], with a mask generation function of MGF1-with-HASH, a hash of HASH, and an empty label.
ja: [RFC3447]の (mask generation function として MGF1-with-HASH を, ハッシュとして HASH を そして空のラベルを用いる) RSAES-OAEP 方式(に従って暗号化は実行される

source: The maximum amount of padding is 255 bytes.
ja: パディングの最大長は, 255 byte だ.

source: Because MACs use a 32-bit sequence number, they might start to leak information after 2**32 packets have been sent.
ja: MACは32bitのシーケンス番号を利用するので, 2**32のパケットが送られたあとでは情報を漏らしはじめる.

source: The defined types are:
ja: 定義済みのタイプは以下の通り:

source: If the server returns this, the client SHOULD provide an option to the user to overwrite the key.
ja: サーバがこれを返したら, クライアントはユーザに鍵を上書きするかの選択を提供する必要がある.

source: In the case of the SSH Transport Protocol, even though an application might implement the symmetric portion of the SSH protocol exactly as described in this document, the application may still be vulnerable to non-protocol-
ja: SSH トランスポートプロトコルの場合, アプリケーションがSSHプロトコルの対称部分をこの文書の記述に正確に実装したとしても, アプリケーションはプロトコルに依存しない攻撃に脆弱かもしれない.(ひどい例を挙げると, アプリケーションが暗号鍵を保護されていないファイルに平文で保存する可能性がある)

source: Implementations MUST ensure they are not vulnerable for a buffer overrun.
ja: 実装は, バッファオーバーランに対して脆弱でないよう保証しなければならない.

source: It is expected that this authentication method would typically be backended by [PAM] and so such choices would not be possible.
ja: この認証方式は, 典型的には [PAM] によって支援されるのでこのような選択は可能ではないことも予想される.

source: The Elliptic Curve Menezes-Qu-Vanstone (ECMQV) key exchange algorithm generates a shared secret from two local elliptic curve key pairs and two remote public keys.
ja: 楕円曲線 Menezes-Qu-Vanstone (ECMQV) 鍵交換アルゴリズムは, 2つのローカルな楕円曲線鍵ペアと2つのリモートの公開鍵から 共有の秘密を生成する.

source: It may optionally also provide compression.
ja: このプロトコルは, オプションで圧縮も提供する.

source: Requests for assignments of new Disconnection Message 'reason code' values (and associated 'description' text) in the range of 0x00000010 to 0xFDFFFFFF MUST be done through the IETF CONSENSUS method, as described in [RFC2434].
ja: 新しい切断メッセージの 'reason code' の値(と関連する 'description') を割り当てる要求は, 0x00000010 から 0xFDFFFFFF の範囲については [RFC2434] に記述されている IETF CONSENSUS におってされなければならない.

source: Generate exchange hash and compute HMAC over it using the shared secret.
ja: 交換ハッシュの生成と, 共有の秘密を用いた交換ハッシュのHMACの計算.

source: Note that the channel remains open after this message, and more data may still be sent in the other direction.
ja: このメッセージのあともチャンネルは開かれた状態で残り, 逆の方向でさらなるデータが送られるかもしれないことに注意.

source: Message Numbers
ja: メッセージ番号

source: IANA Considerations ...........................................27 14.
ja: IANA の考慮 ........................................27 14.

source: Further recall that the total length of the concatenation of the packet length, padding length, payload, and padding MUST be a multiple of the cipher's block size when the cipher's block size is greater than or equal to 8 bytes (which is the case for all of the following methods).
ja: さらに思い出してください: 暗号のブロックサイズが8byte以上の場合(以下の方法のすべてに当てはまる), packet length, padding length, payload, padding を連結した全体の長さが, 暗号のブロックサイズの倍数でなければならない.

source: These controls might include controlling which machines and ports can be targeted in port-forwarding operations, which users are allowed to use interactive shell facilities, or which users are allowed to use exposed subsystems.
ja: この制御は, ポート転送の操作でどのマシンやポートが対象となりうるかや, どのユーザがインタラクティブなシェルの機能の利用を許可されるかや, どのユーザが公開されているサブシステムの利用を許可されるかの制御も含むだろう.
